{
    "rain": " -The spectrogram shows thin vertical streaks scattered across time, mostly in higher frequencies — these are raindrops, which create quick, sharp sounds; their brightness (yellow-green) means they are relatively loud compared to the background.\n                -Several wide horizontal bands appear in low frequencies (below ~300 Hz) — these represent thunder, which is deep and powerful, lasting longer than raindrops.\n                -Brighter colors (yellow) signal stronger sounds, while darker areas (blue/purple) show quieter or background noise.\n                -The background is a soft, grainy texture across mid-range frequencies — this is the steady ambient sound of falling rain.",
    "dish": "\n                -The spectrogram begins with strong, bright curves in high and mid frequencies — these represent the fast, sharp ringing as the plate first spins with high energy.\n                -Over time, the curved patterns slope downward, showing that both frequency and power are gradually decreasing — the plate is losing speed and producing lower-pitched, softer tones.\n                -Brighter yellow areas early on indicate louder, clearer vibrations, while fading green-to-blue regions reflect the gradual weakening of sound as the plate slows.\n                -The repeated, smooth wave-like lines, especially in lower frequencies near the end, capture the wobble and final rotations before the plate settles.\n            ",
    "speak": "\n                -The spectrogram displays a series of repeated, curved vertical patterns in the mid and upper frequencies — these are individual spoken numbers, each with its own vocal signature.\n                -The bright, sharp bursts (especially around 200–500 Hz) reflect the emphasis and clarity in the woman’s speech, with noticeable changes in pitch as each number is spoken.\n                -There is a clear pause around the 14–15 second mark, shown as a dark vertical band with no activity — this marks the break between the two counting sequences.\n                -The spacing and repetition of the patterns mirror the rhythm of the countdown, while the brightness indicates consistent vocal strength and articulation.\n            ",
    "step": "\n                -The spectrogram shows a series of bright, evenly spaced vertical bursts — each one represents a **footstep striking the hard surface**.\n                -These bursts have strong energy in both low and mid frequencies (especially around 100–500 Hz), indicating **sharp impacts with deep reflections**.\n                -The horizontal trails extending from each burst suggest **echo or reverberation**, as the sound reflects off the hard floor and surrounding surfaces.\n                -The consistent spacing and brightness of the impacts suggest **steady walking rhythm**, likely from shoes with firm heels making distinct contact.\n            ",
    "office": "\n                -The spectrogram features frequent vertical bursts followed by textured, mid-frequency smears — each **burst marks the moment the chalk hits the board**, and the following energy traces the **dragging motion** as it writes.\n                -The mid to high frequencies (especially around 500–2000 Hz) capture the **scratchy, gritty texture** of chalk moving across a rough surface.\n                -Some sections show dense, overlapping streaks — these likely reflect **quick, curved or pressured writing**, producing stronger, more resonant tones.\n                -The bottom edge remains consistently active, with faint but steady yellow-green — possibly from **resonant board vibrations or chalk dust collisions**.\n            ",
    "traffic": "\n                -The spectrogram shows a dense, textured pattern across mid frequencies (~300–1500 Hz) — this reflects the **mixed voices and chatter** of a crowd, with overlapping speech tones.\n                -Scattered, wavy lines in higher frequencies represent **individual speech elements**, rising and falling as people talk over one another.\n                -A series of repeating, curved bands stand out more clearly across time, especially in the mid-to-high frequencies — these are the **ringing tones of a bell**, which have a regular shape and brighter intensity.\n                -The overall color pattern is vibrant and active, showing that the soundscape is **busy, layered, and constantly shifting**, with the bell piercing through the background noise.\n            ",
    "pet": "\n                -The spectrogram shows a series of **bright vertical streaks**, spaced fairly evenly over time — each one represents a **single bark**, typically short and loud.\n                -Most energy is concentrated in the **mid-frequency range (around 300–1500 Hz)**, suggesting **deep, resonant vocalizations**.\n                -The vertical shape of each burst shows that the barks are **quick and forceful**, with sharp onsets and fast decays.\n                -Brighter regions within the streaks (yellow-green) indicate **strong intensity**, while the spacing shows a **rhythmic, repeated barking pattern**, likely from a medium or large dog.\n            "
}